read_verilog -defer -DSTOP_COND=0 sodor_core_5stage.v
hierarchy -top Core -check
proc
pmuxtree
opt -purge

mark_resets "" "" reset
mux_probes "" ""
port_mux_probes ""

port_fuzz_inputs "" clock,reset
meta_reset ""
opt_clean

write_verilog -simple-lhs -sv sodor5.sv