read_verilog -defer -DSTOP_COND=0 ./core/*.v ./core/*.vh
hierarchy -top pipeline -check
proc
pmuxtree
opt -purge

mark_resets "" "" reset
mux_probes "" ""
port_mux_probes ""

port_fuzz_inputs "" clk,reset
meta_reset ""
opt_clean

write_verilog -simple-lhs -sv ridecore.sv