read_verilog -defer -DSTOP_COND=0 ./core/*
hierarchy -top mor1kx -check
proc
pmuxtree
opt -purge

mark_resets "" "" rst
mux_probes "" ""
port_mux_probes ""

port_fuzz_inputs "" clk,rst
meta_reset ""
opt_clean

write_verilog -simple-lhs -sv mor1kx.sv